* DONE Represent a product, with name and price
  CLOSED: [2017-03-06 Mon 08:31]
  :LOGBOOK:
  CLOCK: [2017-03-06 Mon 08:26]--[2017-03-06 Mon 08:31] =>  0:05
  CLOCK: [2017-03-06 Mon 08:26]--[2017-03-06 Mon 08:26] =>  0:00
  :END:
* DONE Create a shopping cart - with product list
  CLOSED: [2017-03-06 Mon 08:56]
  :LOGBOOK:
  CLOCK: [2017-03-06 Mon 08:43]--[2017-03-06 Mon 08:56] =>  0:13
  :END:
* DONE Represent a Bill
  CLOSED: [2017-03-06 Mon 09:11]
* DONE Create bill generator
  CLOSED: [2017-03-06 Mon 10:08]
** BillGenerator accepts a pricelist and list of items
   :LOGBOOK:
   CLOCK: [2017-03-06 Mon 10:01]--[2017-03-06 Mon 10:08] => 0:07
   :END:
* DONE Calculate Discount from item count, price and discount%
  CLOSED: [2017-03-07 Tue 18:37]
* DONE Calculate total price
  CLOSED: [2017-03-07 Tue 19:02]
* DONE Add Offer/Discount Models
  CLOSED: [2017-03-09 Thu 13:16]
  :LOGBOOK:
  CLOCK: [2017-03-09 Thu 12:48]--[2017-03-09 Thu 13:13] =>  0:25
  :END:
* TODO Implement Offers
* TODO Apply relevant offers one by one to Shopping cart
* TODO Consider chain of responsibility
